app/controllers/personas_controller.rb

SELECT  "personas".* FROM "personas"   ORDER BY nombre_persona, apellido_persona LIMIT 10 OFFSET 0
---

    else

      @personas = Persona.orden_01.paginate(per_page: 10, page: params[:page])