app/controllers/usuarios_controller.rb


    else

      @usuarios = Usuario.joins(:persona).ordenado_id.paginate(per_page: 10, page: params[:page])
---
SELECT  "usuarios".* FROM "usuarios" INNER JOIN "personas" ON "personas"."id" = "usuarios"."persona_id"  ORDER BY id LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM "usuarios" INNER JOIN "personas" ON "personas"."id" = "usuarios"."persona_id"

  def cambiar_perfil_actual

    current_usuario.perfil_actual_id = params[:perfil_id]
    current_usuario.save
---
UPDATE "usuarios" SET "last_request_at" = $1, "perishable_token" = $2, "updated_at" = $3 WHERE "usuarios"."id" = 28936  [["last_request_at", "2018-11-16 00:19:39.739583"], ["perishable_token", "vvoAwrWfIKqqThkt66"], ["updated_at", "2018-11-16 00:19:39.740287"]]